Revit 2027 API
BuiltInFailures.MEPFabricationFailures.HangerProfileNotMatchWithHost Property
 The defined hanger profile does not match with the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HangerProfileNotMatchWithHost { get; }
Public Shared ReadOnly Property HangerProfileNotMatchWithHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HangerProfileNotMatchWithHost {
	FailureDefinitionId^ get ();
}
static member HangerProfileNotMatchWithHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace